# running in countones/src/
read -formal countones.sv
prep -top countones

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
